clc;
clear;
%输入机器人DH参数,每列按照θ，d，a，alpha输入，每行是第i个关节
A=[0 0 0 0;0 0 25 -pi/2;0 0 560 0;0 515 25 -pi/2;0 0 0 pi/2;0 0 0 -pi/2];
%输入初始角度
A(:,1)=[10*pi/180 10*pi/180 10*pi/180 10*pi/180 10*pi/180 10*pi/180]';
%输入机器人各关节的速度值
joint_sudu=eye(6);
%%计算相邻两杆的变换矩阵；
i=1;
while(i<=6)
    T(:,:,i)=transform(A(i,1),A(i,2),A(i,3),A(i,4));
    R(:,:,i)=rotate(A(i,1),A(i,4));
    P(:,i)=move(A(i,2),A(i,3),A(i,4));
    i=i+1;
end
%%计算各个关节坐标系的角速度与线速度
%输入初始值
w(:,1)=[0 0 0]';v(:,1)=[0 0 0]';i=1;j=1;
%求解各组对应的末端速度
while(j<=6)
while(i<=6)
    w(:,i+1)=R(:,:,i)'*w(:,i)+[0 0 joint_sudu(i,j)]';
    v(:,i+1)=R(:,:,i)'*(v(:,i)+cross(w(:,i),P(:,i)));
    i=i+1;
end
V(:,j)=[v(:,i);w(:,i)];
w(:,i)=[0 0 0]';
v(:,i)=[0 0 0]';
i=1;
j=j+1;
end
J=V

